Revit 2027 API
DefaultDivideSettings.GetSurfaceNumber Method
 Gets the default Divided Surface number for a fixed number layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSurfaceNumber(
	UVGridlineType gridlines
)
Public Function GetSurfaceNumber (
	gridlines As UVGridlineType
) As Integer
public:
int GetSurfaceNumber(
	UVGridlineType gridlines
)
member GetSurfaceNumber :
        gridlines : UVGridlineType -> int
Parameters
gridlines UVGridlineType
 U-gridlines or V-gridlines.
Return Value
Int32
 The default number for a fixed number layout.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace